package com.github.ipcam.entity.exception;

import java.util.HashMap;
import java.util.Map;

/**
 * XmEyeException
 *
 * @author echils
 * @since 2021-04-11 15:07:00
 */
public class XmEyeException extends RuntimeException {


    public static Map ErrorMap = new HashMap() {{
        put(0, "没有错误");
        put(1, "返回成功");
        put(-1, "图片转码失败");
        put(-10000, "非法请求");
        put(-10001, "SDK未经初始化");
        put(-10002, "用户参数不合法");
        put(-10003, "句柄无效");
        put(-10004, "SDK清理出错");
        put(-10005, "等待超时");
        put(-10006, "内存错误，创建内存失败");
        put(-10007, "网络错误");
        put(-10008, "打开文件失败");
        put(-10009, "未知错误");
        put(-11000, "收到数据不正确，可能版本不匹配");
        put(-11001, "版本不支持");
        put(-11131, "路径被使用，无法操作");
        put(-11200, "打开通道失败,可能检测到设备已经不在线");
        put(-11201, "关闭通道失败");
        put(-11202, "建立媒体子连接失败,网络出错或者设备可能不在线");
        put(-11203, "媒体子连接通讯失败,可能检测到设备已经不在线");
        put(-11204, "Nat视频链接达到最大，不允许新的Nat视频链接");
        put(-11205, "版本不支持");
        put(-11206, "请求非法,主连接可能已断开");
        put(-11207, "Tcp视频链接达到最大，不允许新的Tcp视频链接");
        put(-11208, "该通道已经打开预览");
        put(-11300, "无权限");
        put(-11301, "账号密码不对");
        put(-11302, "用户不存在");
        put(-11303, "该用户被锁定");
        put(-11304, "该用户不允许访问(在黑名单中)");
        put(-11305, "该用户已登陆");
        put(-11306, "该用户没有登陆");
        put(-11307, "可能设备不存在");
        put(-11308, "用户管理输入不合法");
        put(-11309, "索引重复");
        put(-11310, "不存在对象");
        put(-11311, "不存在对象");
        put(-11312, "对象正在使用");
        put(-11313, "子集超范围 (如组的权限超过权限表，用户权限超出组的权限范围等等)");
        put(-11314, "密码不正确");
        put(-11315, "密码不匹配");
        put(-11316, "保留帐号");
        put(-11317, "系统维护中，不可登陆");
        put(-11318, "账号密码不对");
        put(-11400, "保存配置后需要重启应用程序");
        put(-11401, "需要重启系统");
        put(-11402, "写文件出错");
        put(-11403, "配置特性不支持");
        put(-11404, "配置校验失败");
        put(-11405, "请求或者设置的配置不存在");
        put(-11500, "暂停失败");
        put(-11501, "查找失败，没有找到对应文件");
        put(-11502, "配置未启用");
        put(-11503, "解码失败");
        put(-11600, "创建套节字失败");
        put(-11601, "连接套节字失败");
        put(-11602, "域名解析失败");
        put(-11603, "发送数据失败");
        put(-11604, "没有获取到设备信息，设备应该不在线");
        put(-11605, "ARSP服务繁忙");
        put(-11606, "ARSP服务繁忙,select失败");
        put(-11607, "ARSP服务繁忙,recvice失败");
        put(-11608, "连接服务器失败");
        put(-11609, "代理");
        put(-11610, "穿透");
        put(-11611, "连接失败");
        put(-11612, "服务器连接数已满");
        put(-11613, "云登陆具体的错误码,说明:当登陆接口的error");
        put(-11614, "前端设备未连接或者连接的前端设备分辨率未知");
        put(-11615, "登录句柄已达到最大值，无法再登录");
        put(-11619, "用户不存在");
        put(-11620, "账号密码不对");
        put(-11621, "查询失败");
        put(-12000, "云登录初始化超时用于区别一般超时情况");
    }};

    public XmEyeException() {
    }

    public XmEyeException(String message) {
        super(message);
    }

    public XmEyeException(Throwable cause) {
        super(cause);
    }

}
